docs/roadmap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-10 Tue 14:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=1024, initial-scale=1" />
<title>Development Roadmap</title>
<meta name="author" content="Mitch Richling" />
<meta name="description" content="Project Development Plans" />
<meta name="keywords" content="MRPTree" />
<meta name="generator" content="Org Mode" />













</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://github.com/richmit/MRPTree/"> UP </a>
 |
 <a accesskey="H" href="https://www.mitchr.me/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Development Roadmap</h1>
<table border="2 solid #ccc" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" align="center">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right"><b>Author:</b></td>
<td class="org-left"><i>Mitch Richling</i></td>
</tr>

<tr>
<td class="org-right"><b>Updated:</b></td>
<td class="org-left"><i>2024-09-10 14:01:06</i></td>
</tr>

<tr>
<td class="org-right"><b>Generated:</b></td>
<td class="org-left"><i>2024-09-10 14:01:08</i></td>
</tr>
</tbody>
</table>
<p align="center">
Copyright &copy; 2024 Mitch Richling. All rights reserved.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org28bea0b">1. High Level Future Development Plans (TODO)</a></li>
<li><a href="#orge097022">2. Raw TODO Comments From Source Code</a></li>
</ul>
</div>
</div>

<div id="outline-container-org28bea0b" class="outline-2">
<h2 id="org28bea0b"><span class="section-number-2">1.</span> High Level Future Development Plans (TODO)</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Example Updates
<ul class="org-ul">
<li>Add Paraview state for vector_field_3d</li>
<li>Add Paraview state &amp; data for surface_plot_step</li>
<li>Add Paraview state &amp; data for trefoil</li>
</ul></li>
<li>Tree Related
<ul class="org-ul">
<li>Adaptive function sample rules (for bitree &amp; quadtree)
<ul class="org-ul">
<li>cell angle</li>
<li>cell aspect ratio</li>
<li>cell width</li>
</ul></li>
</ul></li>
<li>Tree To Complex Related
<ul class="org-ul">
<li>Adapters &amp; interfaces for cell complex edge solvers (<b>WIP</b>)</li>
<li>Cull cells containing domain point</li>
<li>Add meta data to cell point data</li>
<li>Step discontinuity solver</li>
</ul></li>
<li>Cell Complex
<ul class="org-ul">
<li>Edge Solvers
<ul class="org-ul">
<li>SDF (<b>WIP</b>)</li>
<li>Level (<b>WIP</b>)</li>
</ul></li>
<li>Cell Manipulation
<ul class="org-ul">
<li>Point Refine
<ul class="org-ul">
<li>Add a single point</li>
<li>Identify cell "containing" point &#x2013; driven by a cell predicate function</li>
<li>Use function to produce point data for new point</li>
<li>Refine cell into new cells containing point as a vertex (work for segments &amp; triangles)</li>
</ul></li>
</ul></li>
<li>Cell Complex Operations
<ul class="org-ul">
<li>Add cells from another cell complex</li>
<li>Extract level complex with sample function and store in another cell complex
<ul class="org-ul">
<li>Demonstrate edge solver &amp; SDF to extract level curve with a large grid step size</li>
</ul></li>
</ul></li>
</ul></li>
<li>Function Examples
<ul class="org-ul">
<li>Demonstrate how to insert multiple trees into one cell complex (and glue them together?)</li>
<li>Demonstrate cutting on a domain point for bitree example &#x2013; step discontinuity.</li>
</ul></li>
<li>External Interfaces (listed in no particular order)
<ul class="org-ul">
<li>Julia</li>
<li>Maple</li>
<li><i>Consider</i> Ruby</li>
<li><i>Consider</i> Paraview &#x2013; this could be cool, but also very complex.</li>
<li><i>Consider</i> Fortran (Might just do MR_rect_tree)</li>
<li><i>Consider</i> Octave/Matlab</li>
<li><i>Consider</i> Python</li>
</ul></li>
<li><i>Consider</i> Additional file export
<ul class="org-ul">
<li><i>Consider</i> direct POV-Ray</li>
<li><i>Consider</i> direct VTK image/voxel (rectilinear grid)</li>
</ul></li>
<li><i>Consider</i> more MRaster integration
<ul class="org-ul">
<li><i>Consider</i> image generation</li>
<li><i>Consider</i> image output</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orge097022" class="outline-2">
<h2 id="orge097022"><span class="section-number-2">2.</span> Raw TODO Comments From Source Code</h2>
<div class="outline-text-2" id="text-2">
<pre class="example" id="orgd272715">
Tue Sep 10 13:54:43 CDT 2024
lib/MR_cell_cplx.hpp  643   &lt;2024-07-22T15:48:31-0500&gt; vec3_det3: UNTESTED! UNTESTED! UNTESTED! UNTESTED!
lib/MR_cell_cplx.hpp  686   &lt;2024-08-02T09:41:48-0500&gt; geomi_seg_isect_type: Repeated point look-up slows things down
lib/MR_cell_cplx.hpp  687   &lt;2024-08-02T09:41:48-0500&gt; geomi_seg_isect_type: Add unit tests for each code branch
lib/MR_cell_cplx.hpp  804   &lt;2024-08-02T09:42:19-0500&gt; geomr_pnt_line_distance: check logic -- dp1&gt;segd || dp2&gt;segd?
lib/MR_cell_cplx.hpp  834   &lt;2024-07-22T15:48:31-0500&gt; geomr_pnt_tri_distance: UNTESTED! UNTESTED! UNTESTED! UNTESTED! UNTESTED!
lib/MR_cell_cplx.hpp  904   &lt;2024-07-11T16:08:16-0500&gt; geomr_seg_tri_intersection: implement
lib/MR_cell_cplx.hpp  905   &lt;2024-07-11T16:08:27-0500&gt; geomr_seg_tri_intersection: Should this be a bool or an enum?
lib/MR_cell_cplx.hpp  942   &lt;2024-07-11T16:06:42-0500&gt; cell_kind_to_structure: make sure polygons are all oriented correctly
lib/MR_cell_cplx.hpp  1196  &lt;2024-08-02T09:42:38-0500&gt; check_cell_face_intersections: Implement
lib/MR_rect_tree.hpp  641   &lt;2024-07-11T11:50:36-0500&gt; cuc_two_cross: If diti is close to an corner, some result points may be out of range.
lib/MR_rect_tree.hpp  1355  &lt;2024-07-11T16:04:10-0500&gt; cell_is_unbalanced: Optimize run time (nix the use of get_smallest_neighbor_level)
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
<br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br /> <br />
</div>
</body>
</html>
